# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
 - [3,12, 20,24, 35,21]
 - [12,16, 19,36, 40,28]  
 - [36,75, 76,55, 72,146]  
 - [142,110, 192,243, 459,401]  

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, GhostConv, [32, 3, 1]],             #0
  
   [-1, 1, GhostConv, [64, 3, 2]],  
   [-1, 1, GhostConv, [64, 3, 1]],              
   
   [-1, 1, GhostConv, [128, 3, 2]],  
   [-1, 1, GhostConv, [64, 1, 1]],              
   [-2, 1, GhostConv, [64, 1, 1]],              #5
   [-1, 1, GhostConv, [64, 3, 1]],              
   [-1, 1, GhostConv, [64, 3, 1]],              
   [-1, 1, GhostConv, [64, 3, 1]],              
   [-1, 1, GhostConv, [64, 3, 1]],              
   [[-1, -3, -5, -6], 1, Concat, [1]],            #10
   [-1, 1, GhostConv, [256, 1, 1]],         
   [-1, 1, CBAM, [256]],                          
         
   [-1, 1, MP, []],                               
   [-1, 1, GhostConv, [128, 1, 1]],             
   [-3, 1, GhostConv, [128, 1, 1]],             #15
   [-1, 1, GhostConv, [128, 3, 2]],             
   [[-1, -3], 1, Concat, [1]],              
   [-1, 1, GhostConv, [128, 1, 1]],             
   [-2, 1, GhostConv, [128, 1, 1]],             
   [-1, 1, GhostConv, [128, 3, 1]],             #20
   [-1, 1, GhostConv, [128, 3, 1]],             
   [-1, 1, GhostConv, [128, 3, 1]],             
   [-1, 1, GhostConv, [128, 3, 1]],             
   [[-1, -3, -5, -6], 1, Concat, [1]],            
   [-1, 1, GhostConv, [512, 1, 1]],             #25
   [-1, 1, CBAM, [512]],                          
         
   [-1, 1, MP, []],                               
   [-1, 1, GhostConv, [256, 1, 1]],             
   [-3, 1, GhostConv, [256, 1, 1]],             
   [-1, 1, GhostConv, [256, 3, 2]],             #30
   [[-1, -3], 1, Concat, [1]],             
   [-1, 1, GhostConv, [256, 1, 1]],             
   [-2, 1, GhostConv, [256, 1, 1]],             
   [-1, 1, GhostConv, [256, 3, 1]], 
   [-1, 1, GhostConv, [256, 3, 1]],             #35
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],            
   [-1, 1, GhostConv, [1024, 1, 1]],  
   [-1, 1, CBAM, [1024]],                         #40

   [-1, 1, MP, []],
   [-1, 1, GhostConv, [512, 1, 1]],
   [-3, 1, GhostConv, [512, 1, 1]],             
   [-1, 1, GhostConv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],                    #45
   [-1, 1, GhostConv, [256, 1, 1]],
   [-2, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],             
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],             #50
   [-1, 1, GhostConv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [1024, 1, 1]],  
   [-1, 1, CBAM, [1024]],
  ]

# yolov7 head
head:
  [[-1, 1, GhostSPPCSPC, [512]],                       #55
  
   [-1, 1, GhostConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [39, 1, GhostConv, [256, 1, 1]], 
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, GhostConv, [256, 1, 1]],              #60
   [-2, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],              #65
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [256, 1, 1]], 
   
   [-1, 1, GhostConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [25, 1, GhostConv, [128, 1, 1]],              #70
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, GhostConv, [128, 1, 1]],
   [-2, 1, GhostConv, [128, 1, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],               #75
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [128, 1, 1]], 
      
   [-1, 1, MP, []],                                #80
   [-1, 1, GhostConv, [256, 1, 1]],
   [-3, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [256, 3, 2]],
   [[-1, -3, 67], 1, Concat, [1]],
   
   [-1, 1, GhostConv, [256, 1, 1]],              #85
   [-2, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],              #90
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [256, 1, 1]], 
      
   [-1, 1, MP, []],
   [-1, 1, GhostConv, [512, 1, 1]],
   [-3, 1, GhostConv, [512, 1, 1]],              #95
   [-1, 1, GhostConv, [512, 3, 2]],
   [[-1, -3, 55], 1, Concat, [1]],
   
   [-1, 1, GhostConv, [512, 1, 1]],
   [-2, 1, GhostConv, [512, 1, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],               #100
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [512, 1, 1]],               #105

   [79, 1, GhostConv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [11, 1, GhostConv, [64, 1, 1]],
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, GhostConv, [64, 1, 1]],               #110
   [-2, 1, GhostConv, [64, 1, 1]],               
   [-1, 1, GhostConv, [32, 3, 1]],               
   [-1, 1, GhostConv, [32, 3, 1]],
   [-1, 1, GhostConv, [32, 3, 1]],
   [-1, 1, GhostConv, [32, 3, 1]],                #115
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],      
   [-1, 1, GhostConv, [64, 1, 1]],

   [-1, 1, MP, []],
   [-1, 1, GhostConv, [64, 1, 1]],
   [-3, 1, GhostConv, [64, 1, 1]],               #120
   [-1, 1, GhostConv, [64, 3, 2]],               
   [[-1, -3], 1, Concat, [1]],

   [-1, 1, GhostConv, [64, 1, 1]],
   [-2, 1, GhostConv, [64, 1, 1]],
   [-1, 1, GhostConv, [32, 3, 1]],               #125
   [-1, 1, GhostConv, [32, 3, 1]],               
   [-1, 1, GhostConv, [32, 3, 1]],
   [-1, 1, GhostConv, [32, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [64, 1, 1]],               #130

   [130, 1, RepConv, [128, 3, 1]],            
   [79, 1, RepConv, [256, 3, 1]],
   [92, 1, RepConv, [512, 3, 1]],
   [105, 1, RepConv, [1024, 3, 1]],
   
   [[131, 132, 133, 134], 1, IDetect, [nc, anchors]],   
  ]
